# np.random.rand() #одно число float от 0--1
# np.random.rand(5) #5 чисел float массив от 0--1
# np.random.rand(2, 3) #двумерный массив float от 0--1
# np.random.rand(2, 3, 4, 10, 12, 23) #6 мерный массив float от 0--1
# shape = (3, 4)
# np.random.rand(*shape)
# np.random.sample(shape) # замена rand
# np.random.uniform(x,y,size=n) # генирация x=от y=до n=число элементов
# np.random.randint(low, high=None, size=None, dtype=int)

# np.random.shuffle(arr) #перемешивает массив
# arr_new = np.random.permutation(arr) #делает новый перемешанный массив
# np.random.permutation(10)

# workers = ['Ivan', 'Nikita', 'Maria', 'John', 'Kate']
# choice = np.random.choice(workers, size=2, replace=False)
# choice = np.random.choice([1,2,3,4,5,6], size=10)

# np.random.seed(23)
# np.random.randint(10, size=(3,4))

import numpy as np

seed_np = 2021
np.random.seed(seed_np)

simple=np.random.rand()
randoms=np.random.uniform(-150, 2021, 120)
table=np.random.randint(1,101, size=(3,2), dtype=int)
even=np.arange(2,17,2)
mix=even.copy()
np.random.shuffle(mix)
select=np.random.choice(even,3,False)
triplet=np.random.permutation(select)
print(randoms)
#  [1.44214488e+03  1.51654277e+02  5.28813265e+02  2.01501516e+03
#   1.28240517e+02  2.38594033e+02  1.48460111e+03  1.28755048e+03
#   1.55273730e+03  6.03577336e+01 -2.28417401e+01  1.93936169e+03
#   1.18854621e+03  3.80736459e+01  1.06852230e+03  1.18847514e+03
#   1.94250320e+03  1.09681462e+03  6.55790201e+02  8.31607324e+02
#   2.88216888e+02  1.08596141e+03  2.73553360e+02  1.11722142e+03
#   8.84076551e+02  9.74175063e+02  1.63694713e+03  1.43966053e+03
#  -7.88273550e-02  1.30919192e+03  1.24700551e+03  1.64761920e+03
#   2.93903055e+02  1.19056852e+03  1.19102890e+03  5.03619976e+02
#   1.74254881e+03  1.13013901e+03  1.98142287e+03  8.10086179e+02
#   1.24235695e+02  9.54671885e+02  7.87407805e+02  1.83850479e+03
#   1.38927296e+03  1.78361285e+03  1.12847065e+03  1.23255777e+03
#   5.92935602e+02  1.63845066e+03  5.12482326e+02  5.17676863e+02
#   2.87071500e+02  4.25673103e+02  1.26315547e+03  1.85668749e+02
#   6.93866612e+02  1.25597031e+03  1.69165738e+03 -1.14109610e+01
#   7.49751798e+02  5.71302264e+02  1.41598784e+03  8.78722492e+02
#   1.58385034e+03  4.72720431e+01  1.74866286e+03  1.53681677e+03
#   1.52507069e+03 -1.30026693e+01  1.14052595e+03  1.57050607e+03
#   4.45144214e+02  6.55484014e+02  1.70211167e+03  1.32352048e+03
#   1.48775347e+03  7.55865456e+02  5.46671153e+02  6.58255417e+02
#   4.47789576e+02  1.32531521e+03  1.11271101e+03  1.95630157e+03
#   7.52065787e+02  5.67491766e+02  1.94873645e+03  1.64302682e+03
#   5.13023798e+02  1.63733634e+03  1.05905257e+03  1.40986573e+03
#   1.76034306e+03  9.26837823e+02  9.61739380e+02  1.25799224e+03
#   5.95362077e+02  1.20174562e+03  8.58645865e+02  1.18856546e+02
#   1.97784238e+03  8.32199760e+02  1.05091750e+02  1.63022440e+03
#   2.30207657e+02  3.50845784e+02  1.38015863e+03  1.40801317e+03
#   1.71847049e+02  7.04684178e+02  1.59248393e+03  1.60891952e+03
#   1.57812208e+03  1.71269509e+03  4.94223069e+02  1.94849514e+02
#   1.33961669e+03  1.44252669e+03  1.71320327e+02  4.28962033e+02]